import Product, {
  type ProductItem,
} from '@/components/features/admin/productcard';

const products: ProductItem[] = [
  {
    id: '1',
    name: 'Amethyst Cathedral',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/amethyst3.png',
  },
  {
    id: '2',
    name: 'Amethyst Cathedral',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/amethyst3.png',
  },
  {
    id: '3',
    name: 'Amethyst Cathedral',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/amethyst3.png',
  },
  {
    id: '4',
    name: 'Amethyst Cathedral',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/amethyst3.png',
  },
  {
    id: '5',
    name: 'Rose Quartz Heart',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '6',
    name: 'Citrine Cluster',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '7',
    name: 'Black Tourmaline',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '8',
    name: 'Moonstone Glow',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '9',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '10',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '11',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '12',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '13',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '14',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '15',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '16',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '17',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '18',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '19',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '20',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
];

export default function ProductPage() {
  return (
    <Product
      title="สินค้า"
      subtitle="จัดการสินค้าคงคลัง"
      addButtonText="+ เพิ่มสินค้า"
      searchPlaceholder="ค้นหาสินค้า..."
      products={products}
    />
  );
}
