import ProductList, {
  ProductItem,
} from '@/components/features/admin/product-management/product-list';

const products: ProductItem[] = [
  {
    id: '1',
    name: 'Amethyst Cathedral',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/amethyst3.png',
  },
  {
    id: '2',
    name: 'Amethyst Cathedral',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/amethyst3.png',
  },
  {
    id: '3',
    name: 'Amethyst Cathedral',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/amethyst3.png',
  },
  {
    id: '4',
    name: 'Amethyst Cathedral',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/amethyst3.png',
  },
  {
    id: '5',
    name: 'Rose Quartz Heart',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '6',
    name: 'Citrine Cluster',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '7',
    name: 'Black Tourmaline',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '8',
    name: 'Moonstone Glow',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '9',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '10',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '11',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '12',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '13',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '14',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '15',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '16',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '17',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '18',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '19',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
  {
    id: '20',
    name: 'Tiger Eye Stone',
    description:
      'อะเมทิสต์เป็นหินแห่ง ความสงบ สติ การป้องกันพลังลบ และการเยียวยาใจ เหมาะกับคนที่คิดมาก เครียดง่าย หรือต้องการความนิ่งในชีวิต หินชนิดนี้ยังเชื่อมกับพลังจิตและการทำสมาธิด้วย ในแง่เสริมดวง อะเมทิสต์เหมาะกับการลดเครียด ปรับอารมณ์ ป้องกันพลังไม่ดี และเสริมปัญญาในสถานการณ์ที่ต้องใช้สติสูง เป็นหินที่เหมาะกับคนทำงานหนักหรือคนที่ใจไม่ค่อยได้พัก',
    price: 145,
    stock: 15,
    image: '/stone/aquamarine1.png',
  },
];

export default function ProductPage() {
  return (
    <>
      <div className="flex justify-between gap-8 px-8">
        <div>
          <h1 className="text-4xl font-bold tracking-tight text-black md:text-4xl">
            สินค้า
          </h1>
          <p className="text-base text-neutral-700 md:text-lg">
            จัดการสินค้าคงคลัง
          </p>
        </div>
        <div className="mb-10 flex flex-col gap-5 md:flex-row md:items-start md:justify-between">
          <button
            type="button"
            className="h-14 rounded-2xl bg-[#3b82f6] px-7 text-[18px] font-medium text-white transition hover:bg-[#2563eb]"
          >
            + เพิ่มสินค้า
          </button>
        </div>
      </div>
      <ProductList searchPlaceholder="ค้นหาสินค้า..." products={products} />
    </>
  );
}
